IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_pa_stat_push3" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_pa_stat_push3" offset="0x4C" width="32" description="">
		<bitfield id="PA_STAT_PUSH3_3" width="8" begin="31" end="24" resetval="0x0" description="pa stat push3" range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PA_STAT_PUSH2_3" width="8" begin="23" end="16" resetval="0x0" description="pa stat push2" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PA_STAT_PUSH1_3" width="8" begin="15" end="8" resetval="0x0" description="pa stat push1" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PA_STAT_PUSH0_3" width="8" begin="7" end="0" resetval="0x0" description="pa stat push0" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_fdb_gen_cfg1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_fdb_gen_cfg1" offset="0x60" width="32" description="">
		<bitfield id="SMEM_VLAN_OFFSET" width="18" begin="25" end="8" resetval="0x0" description="SMEM VLAN FID table  base address" range="25 - 8" rwaccess="R/W"/> 
		<bitfield id="FDB_HASH_SIZE" width="4" begin="6" end="3" resetval="0x4" description="FDB hash size 0:64 1:128 2:256 3:512 4:1024 5:2048" range="6 - 3" rwaccess="R/W"/> 
		<bitfield id="FDB_BUCKET_SIZE" width="2" begin="1" end="0" resetval="0x2" description="FDB buket size 0:1 1:2 2:4 3:8" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_fdb_gen_cfg2" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_fdb_gen_cfg2" offset="0x64" width="32" description="">
		<bitfield id="FDB_GEN_MODE_BYTE_EN" width="4" begin="12" end="9" resetval="0x0" description="FDB General Mode Byte compare size 0 = 1 Byte, 15 = 16 Bytes" range="12 - 9" rwaccess="R/W"/> 
		<bitfield id="FDB_GEN_MODE_EN_BK1" width="1" begin="8" end="8" resetval="0x0" description="FDB General Mode Enable Bank1 if set PRU0/PRU1/HOST will get disabled " range="8" rwaccess="R/W"/> 
		<bitfield id="FDB_GEN_MODE_EN_BK0" width="1" begin="7" end="7" resetval="0x0" description="FDB General Mode Enable Bank0 if set PRU0/PRU1/HOST will get disabled " range="7" rwaccess="R/W"/> 
		<bitfield id="FDB_VLAN_EN" width="1" begin="6" end="6" resetval="0x0" description="FDB Global VLAN Enable" range="6" rwaccess="R/W"/> 
		<bitfield id="FDB_HSR_EN" width="1" begin="5" end="5" resetval="0x0" description="FDB Global HSR Enable note VLAN most be disabled" range="5" rwaccess="R/W"/> 
		<bitfield id="FDB_HOST_EN" width="1" begin="2" end="2" resetval="0x0" description="FDB HOST Enable" range="2" rwaccess="R/W"/> 
		<bitfield id="FDB_PRU1_EN" width="1" begin="1" end="1" resetval="0x0" description="FDB PRU1 Enable" range="1" rwaccess="R/W"/> 
		<bitfield id="FDB_PRU0_EN" width="1" begin="0" end="0" resetval="0x0" description="FDB PRU0 Enable" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_fdb_gen_status" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_fdb_gen_status" offset="0x68" width="32" description="">
		
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_fdb_df_vlan" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_fdb_df_vlan" offset="0x6C" width="32" description="">
		<bitfield id="FDB_PRU1_DF_VLAN" width="12" begin="27" end="16" resetval="0x1" description="FDB Default VLAN for PRU1" range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="FDB_PRU0_DF_VLAN" width="12" begin="11" end="0" resetval="0x1" description="FDB Default VLAN for PRU0" range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_fdb_host_da0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_fdb_host_da0" offset="0x70" width="32" description="">
		<bitfield id="FDB_HOST_DA0" width="32" begin="31" end="0" resetval="0x0" description="FDB HOST DA3:0 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_fdb_host_da1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_fdb_host_da1" offset="0x74" width="32" description="">
		<bitfield id="FDB_HOST_DA1" width="16" begin="15" end="0" resetval="0x0" description="FDB HOST DA5:4 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_fdb_host_sa0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_fdb_host_sa0" offset="0x78" width="32" description="">
		<bitfield id="FDB_HOST_SA0" width="32" begin="31" end="0" resetval="0x0" description="FDB HOST SA3:0 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_fdb_host_vlan_sa1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_fdb_host_vlan_sa1" offset="0x7C" width="32" description="">
		<bitfield id="FDB_HOST_VLAN_HSR" width="16" begin="31" end="16" resetval="0x1" description="FDB HOST VLAN[11:0] OR HSR[15:0]  " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="FDB_HOST_SA1" width="16" begin="15" end="0" resetval="0x0" description="FDB HOST SA5:4 " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_start_len_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_start_len_pru0" offset="0x80" width="32" description="">
		<bitfield id="FT1_LEN" width="4" begin="19" end="16" resetval="0x6" description="Defines the total number of Bytes Filter1 will check before Valid bit is set" range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="FT1_START" width="15" begin="14" end="0" resetval="0x0" description="Byte count start for Filter1. Any wrt will clear all Filter1 Status Bits" range="14 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_cfg_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_cfg_pru0" offset="0x84" width="32" description="">
		<bitfield id="FT1_7CFG" width="2" begin="15" end="14" resetval="0x1" description="0: Disabled  1: EQ   2: GT  3: LT" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="FT1_6CFG" width="2" begin="13" end="12" resetval="0x1" description="0: Disabled  1: EQ   2: GT  3: LT" range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="FT1_5CFG" width="2" begin="11" end="10" resetval="0x1" description="0: Disabled  1: EQ   2: GT  3: LT" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="FT1_4CFG" width="2" begin="9" end="8" resetval="0x1" description="0: Disabled  1: EQ   2: GT  3: LT" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="FT1_3CFG" width="2" begin="7" end="6" resetval="0x1" description="0: Disabled  1: EQ   2: GT  3: LT" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="FT1_2CFG" width="2" begin="5" end="4" resetval="0x1" description="0: Disabled  1: EQ   2: GT  3: LT" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="FT1_1CFG" width="2" begin="3" end="2" resetval="0x1" description="0: Disabled  1: EQ   2: GT  3: LT" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="FT1_0CFG" width="2" begin="1" end="0" resetval="0x1" description="0: Disabled  1: EQ   2: GT  3: LT" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_0_da0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_0_da0_pru0" offset="0x88" width="32" description="">
		<bitfield id="FT1_0_DA0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 DA4:DA1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_0_da1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_0_da1_pru0" offset="0x8C" width="32" description="">
		<bitfield id="FT1_0_DA1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 DA6:DA5  " range="15 - 0" rwaccess="R/W"/>
	</register>
