IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_0_da_mask0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_0_da_mask0_pru0" offset="0x90" width="32" description="">
		<bitfield id="FT1_0_DA_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 MDA4:MDA1  set to 1 to mask that bit " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_0_da_mask1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_0_da_mask1_pru0" offset="0x94" width="32" description="">
		<bitfield id="FT1_0_DA_MASK1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 MDA6:MDA5  set to 1 to mask that bit  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_1_da0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_1_da0_pru0" offset="0x98" width="32" description="">
		<bitfield id="FT1_1_DA0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 DA4:DA1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_1_da1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_1_da1_pru0" offset="0x9C" width="32" description="">
		<bitfield id="FT1_1_DA1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 DA6:DA5  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_1_da_mask0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_1_da_mask0_pru0" offset="0xA0" width="32" description="">
		<bitfield id="FT1_1_DA_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 MDA4:MDA1  set to 1 to mask that bit " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_1_da_mask1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_1_da_mask1_pru0" offset="0xA4" width="32" description="">
		<bitfield id="FT1_1_DA_MASK1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 MDA6:MDA5  set to 1 to mask that bit  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_2_da0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_2_da0_pru0" offset="0xA8" width="32" description="">
		<bitfield id="FT1_2_DA0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 DA4:DA1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_2_da1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_2_da1_pru0" offset="0xAC" width="32" description="">
		<bitfield id="FT1_2_DA1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 DA6:DA5  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_2_da_mask0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_2_da_mask0_pru0" offset="0xB0" width="32" description="">
		<bitfield id="FT1_2_DA_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 MDA4:MDA1  set to 1 to mask that bit " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_2_da_mask1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_2_da_mask1_pru0" offset="0xB4" width="32" description="">
		<bitfield id="FT1_2_DA_MASK1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 MDA6:MDA5  set to 1 to mask that bit  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_3_da0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_3_da0_pru0" offset="0xB8" width="32" description="">
		<bitfield id="FT1_3_DA0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 DA4:DA1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_3_da1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_3_da1_pru0" offset="0xBC" width="32" description="">
		<bitfield id="FT1_3_DA1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 DA6:DA5  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_3_da_mask0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_3_da_mask0_pru0" offset="0xC0" width="32" description="">
		<bitfield id="FT1_3_DA_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 MDA4:MDA1  set to 1 to mask that bit " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_3_da_mask1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_3_da_mask1_pru0" offset="0xC4" width="32" description="">
		<bitfield id="FT1_3_DA_MASK1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 MDA6:MDA5  set to 1 to mask that bit  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_4_da0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_4_da0_pru0" offset="0xC8" width="32" description="">
		<bitfield id="FT1_4_DA0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 DA4:DA1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_4_da1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_4_da1_pru0" offset="0xCC" width="32" description="">
		<bitfield id="FT1_4_DA1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 DA6:DA5  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_4_da_mask0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_4_da_mask0_pru0" offset="0xD0" width="32" description="">
		<bitfield id="FT1_4_DA_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 MDA4:MDA1  set to 1 to mask that bit " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_4_da_mask1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_4_da_mask1_pru0" offset="0xD4" width="32" description="">
		<bitfield id="FT1_4_DA_MASK1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 MDA6:MDA5  set to 1 to mask that bit  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_5_da0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_5_da0_pru0" offset="0xD8" width="32" description="">
		<bitfield id="FT1_5_DA0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 DA4:DA1  " range="31 - 0" rwaccess="R/W"/>
	</register>
