IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_jmp_offset_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_jmp_offset_pru0" offset="0x1D4" width="32" description="">
		<bitfield id="FT3_6_NJMP_OFFSET_PRU0" width="15" begin="30" end="16" resetval="0x0" description="Defines the Next Offset to compare when auto arm jump is enabled" range="30 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_6_IJMP_OFFSET_PRU0" width="15" begin="14" end="0" resetval="0x0" description="Defines the Intial Offset to compare when auto arm jump is enabled " range="14 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_len_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_len_pru0" offset="0x1D8" width="32" description="">
		<bitfield id="FT3_6_LEN_BIG_EN_PRU0" width="1" begin="24" end="24" resetval="0x0" description="Enable Big Indian on Length" range="24" rwaccess="R/W"/> 
		<bitfield id="FT3_6_LEN_SIZE_BIT_PRU0" width="4" begin="19" end="16" resetval="0x0" description="Defines number of bits to extract the length for the auto skip function" range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_6_LEN_START_BIT_PRU0" width="9" begin="8" end="0" resetval="0x0" description="Defines relative bit offset from the HIT byte location upto 512 bit offset the exraction to determine the on the fly length byte offset" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_cfg_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_cfg_pru0" offset="0x1DC" width="32" description="">
		<bitfield id="FT3_6_TRIG_OR_EN" width="16" begin="31" end="16" resetval="0x0" description="Trigger ft3 select for auto skip enable, if one or more set the function is enabled note you can not slect the same ft3 only others" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_6_VLAN_SKIP_EN" width="1" begin="2" end="2" resetval="0x1" description="0: Disabled  1: Enable" range="2" rwaccess="R/W"/> 
		<bitfield id="FT3_6CFG" width="2" begin="1" end="0" resetval="0x1" description="0: Disabled  1: EQ  2: GT  3: LT" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_t_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_t_pru0" offset="0x1E0" width="32" description="">
		<bitfield id="FT3_6_T" width="32" begin="31" end="0" resetval="0x0" description="Filter3 T4:T1  Note if Auto Skip is enabled then Type filter is not enabled" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_t_mask_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_t_mask_pru0" offset="0x1E4" width="32" description="">
		<bitfield id="FT3_6_T_MASK" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MT4:MT1   Note if Auto Skip is enabled then Type filter is not enabled   set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_start_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_start_pru0" offset="0x1E8" width="32" description="">
		<bitfield id="FT3_START" width="15" begin="14" end="0" resetval="0x12" description="Byte count start for Filter3. Any wrt will clear all Filter3 Status Bits SW can read to determine next start during Auto " range="14 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_start_auto_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_start_auto_pru0" offset="0x1EC" width="32" description="">
		<bitfield id="FT3_START_AUTO" width="15" begin="14" end="0" resetval="0x0" description="Byte count start for Auto skip mode" range="14 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_start_len_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_start_len_pru0" offset="0x1F0" width="32" description="">
		<bitfield id="FT3_OFFSET_END" width="3" begin="22" end="20" resetval="0x0" description="Defines which byte within FT3_[N]P[63:0] to end the compare at set the Valid flag,  rule ft3_offset_end >= ft3_offset_start To disable pattern compare set start and end to zero " range="22 - 20" rwaccess="R/W"/> 
		<bitfield id="FT3_OFFSET_START" width="3" begin="18" end="16" resetval="0x0" description="Defines which byte within FT3_[N]P[63:0] to start the compare " range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_OFFSET" width="15" begin="14" end="0" resetval="0x0" description="Determine which byte to start FT3_[N]P[63:0] operation it will start on the next byte after FT3_T completes if set to zero " range="14 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_jmp_offset_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_jmp_offset_pru0" offset="0x1F4" width="32" description="">
		<bitfield id="FT3_7_NJMP_OFFSET_PRU0" width="15" begin="30" end="16" resetval="0x0" description="Defines the Next Offset to compare when auto arm jump is enabled" range="30 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_7_IJMP_OFFSET_PRU0" width="15" begin="14" end="0" resetval="0x0" description="Defines the Intial Offset to compare when auto arm jump is enabled " range="14 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_len_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_len_pru0" offset="0x1F8" width="32" description="">
		<bitfield id="FT3_7_LEN_BIG_EN_PRU0" width="1" begin="24" end="24" resetval="0x0" description="Enable Big Indian on Length" range="24" rwaccess="R/W"/> 
		<bitfield id="FT3_7_LEN_SIZE_BIT_PRU0" width="4" begin="19" end="16" resetval="0x0" description="Defines number of bits to extract the length for the auto skip function" range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_7_LEN_START_BIT_PRU0" width="9" begin="8" end="0" resetval="0x0" description="Defines relative bit offset from the HIT byte location upto 512 bit offset the exraction to determine the on the fly length byte offset" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_cfg_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_cfg_pru0" offset="0x1FC" width="32" description="">
		<bitfield id="FT3_7_TRIG_OR_EN" width="16" begin="31" end="16" resetval="0x0" description="Trigger ft3 select for auto skip enable, if one or more set the function is enabled note you can not slect the same ft3 only others" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_7_VLAN_SKIP_EN" width="1" begin="2" end="2" resetval="0x1" description="0: Disabled  1: Enable" range="2" rwaccess="R/W"/> 
		<bitfield id="FT3_7CFG" width="2" begin="1" end="0" resetval="0x1" description="0: Disabled  1: EQ  2: GT  3: LT" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_t_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_t_pru0" offset="0x200" width="32" description="">
		<bitfield id="FT3_7_T" width="32" begin="31" end="0" resetval="0x0" description="Filter3 T4:T1  Note if Auto Skip is enabled then Type filter is not enabled" range="31 - 0" rwaccess="R/W"/>
	</register>
