IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_p_mask0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_p_mask0_pru0" offset="0x350" width="32" description="">
		<bitfield id="FT3_4_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_p_mask1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_p_mask1_pru0" offset="0x354" width="32" description="">
		<bitfield id="FT3_4_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_p0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_p0_pru0" offset="0x358" width="32" description="">
		<bitfield id="FT3_5_P0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P4:P1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_p1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_p1_pru0" offset="0x35C" width="32" description="">
		<bitfield id="FT3_5_P1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P8:P5  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_p_mask0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_p_mask0_pru0" offset="0x360" width="32" description="">
		<bitfield id="FT3_5_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_p_mask1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_p_mask1_pru0" offset="0x364" width="32" description="">
		<bitfield id="FT3_5_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_p0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_p0_pru0" offset="0x368" width="32" description="">
		<bitfield id="FT3_6_P0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P4:P1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_p1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_p1_pru0" offset="0x36C" width="32" description="">
		<bitfield id="FT3_6_P1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P8:P5  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_p_mask0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_p_mask0_pru0" offset="0x370" width="32" description="">
		<bitfield id="FT3_6_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_p_mask1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_p_mask1_pru0" offset="0x374" width="32" description="">
		<bitfield id="FT3_6_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_p0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_p0_pru0" offset="0x378" width="32" description="">
		<bitfield id="FT3_7_P0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P4:P1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_p1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_p1_pru0" offset="0x37C" width="32" description="">
		<bitfield id="FT3_7_P1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P8:P5  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_p_mask0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_p_mask0_pru0" offset="0x380" width="32" description="">
		<bitfield id="FT3_7_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_p_mask1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_p_mask1_pru0" offset="0x384" width="32" description="">
		<bitfield id="FT3_7_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_8_p0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_8_p0_pru0" offset="0x388" width="32" description="">
		<bitfield id="FT3_8_P0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P4:P1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_8_p1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_8_p1_pru0" offset="0x38C" width="32" description="">
		<bitfield id="FT3_8_P1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P8:P5  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_8_p_mask0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_8_p_mask0_pru0" offset="0x390" width="32" description="">
		<bitfield id="FT3_8_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_8_p_mask1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_8_p_mask1_pru0" offset="0x394" width="32" description="">
		<bitfield id="FT3_8_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_9_p0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_9_p0_pru0" offset="0x398" width="32" description="">
		<bitfield id="FT3_9_P0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P4:P1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_9_p1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_9_p1_pru0" offset="0x39C" width="32" description="">
		<bitfield id="FT3_9_P1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P8:P5  " range="31 - 0" rwaccess="R/W"/>
	</register>
