IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_9_p_mask0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_9_p_mask0_pru0" offset="0x3A0" width="32" description="">
		<bitfield id="FT3_9_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_9_p_mask1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_9_p_mask1_pru0" offset="0x3A4" width="32" description="">
		<bitfield id="FT3_9_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_10_p0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_10_p0_pru0" offset="0x3A8" width="32" description="">
		<bitfield id="FT3_10_P0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P4:P1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_10_p1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_10_p1_pru0" offset="0x3AC" width="32" description="">
		<bitfield id="FT3_10_P1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P8:P5  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_10_p_mask0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_10_p_mask0_pru0" offset="0x3B0" width="32" description="">
		<bitfield id="FT3_10_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_10_p_mask1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_10_p_mask1_pru0" offset="0x3B4" width="32" description="">
		<bitfield id="FT3_10_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_11_p0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_11_p0_pru0" offset="0x3B8" width="32" description="">
		<bitfield id="FT3_11_P0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P4:P1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_11_p1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_11_p1_pru0" offset="0x3BC" width="32" description="">
		<bitfield id="FT3_11_P1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P8:P5  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_11_p_mask0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_11_p_mask0_pru0" offset="0x3C0" width="32" description="">
		<bitfield id="FT3_11_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_11_p_mask1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_11_p_mask1_pru0" offset="0x3C4" width="32" description="">
		<bitfield id="FT3_11_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_12_p0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_12_p0_pru0" offset="0x3C8" width="32" description="">
		<bitfield id="FT3_12_P0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P4:P1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_12_p1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_12_p1_pru0" offset="0x3CC" width="32" description="">
		<bitfield id="FT3_12_P1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P8:P5  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_12_p_mask0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_12_p_mask0_pru0" offset="0x3D0" width="32" description="">
		<bitfield id="FT3_12_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_12_p_mask1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_12_p_mask1_pru0" offset="0x3D4" width="32" description="">
		<bitfield id="FT3_12_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_13_p0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_13_p0_pru0" offset="0x3D8" width="32" description="">
		<bitfield id="FT3_13_P0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P4:P1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_13_p1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_13_p1_pru0" offset="0x3DC" width="32" description="">
		<bitfield id="FT3_13_P1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P8:P5  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_13_p_mask0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_13_p_mask0_pru0" offset="0x3E0" width="32" description="">
		<bitfield id="FT3_13_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_13_p_mask1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_13_p_mask1_pru0" offset="0x3E4" width="32" description="">
		<bitfield id="FT3_13_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_14_p0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_14_p0_pru0" offset="0x3E8" width="32" description="">
		<bitfield id="FT3_14_P0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P4:P1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_14_p1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_14_p1_pru0" offset="0x3EC" width="32" description="">
		<bitfield id="FT3_14_P1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P8:P5  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_14_p_mask0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_14_p_mask0_pru0" offset="0x3F0" width="32" description="">
		<bitfield id="FT3_14_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
