IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_14_p_mask1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_14_p_mask1_pru0" offset="0x3F4" width="32" description="">
		<bitfield id="FT3_14_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_p0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_p0_pru0" offset="0x3F8" width="32" description="">
		<bitfield id="FT3_15_P0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P4:P1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_p1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_p1_pru0" offset="0x3FC" width="32" description="">
		<bitfield id="FT3_15_P1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P8:P5  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_p_mask0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_p_mask0_pru0" offset="0x400" width="32" description="">
		<bitfield id="FT3_15_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_p_mask1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_p_mask1_pru0" offset="0x404" width="32" description="">
		<bitfield id="FT3_15_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft_rx_ptr_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft_rx_ptr_pru0" offset="0x408" width="32" description="">
		<bitfield id="FT_RX_PTR_PRU0" width="32" begin="31" end="0" resetval="0x0" description="RX current filter Byte Count  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class0_and_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class0_and_en_pru0" offset="0x40C" width="32" description="">
		<bitfield id="RX_CLASS0_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class0_or_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class0_or_en_pru0" offset="0x410" width="32" description="">
		<bitfield id="RX_CLASS0_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class1_and_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class1_and_en_pru0" offset="0x414" width="32" description="">
		<bitfield id="RX_CLASS1_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class1_or_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class1_or_en_pru0" offset="0x418" width="32" description="">
		<bitfield id="RX_CLASS1_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class2_and_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class2_and_en_pru0" offset="0x41C" width="32" description="">
		<bitfield id="RX_CLASS2_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class2_or_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class2_or_en_pru0" offset="0x420" width="32" description="">
		<bitfield id="RX_CLASS2_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class3_and_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class3_and_en_pru0" offset="0x424" width="32" description="">
		<bitfield id="RX_CLASS3_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class3_or_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class3_or_en_pru0" offset="0x428" width="32" description="">
		<bitfield id="RX_CLASS3_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class4_and_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class4_and_en_pru0" offset="0x42C" width="32" description="">
		<bitfield id="RX_CLASS4_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class4_or_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class4_or_en_pru0" offset="0x430" width="32" description="">
		<bitfield id="RX_CLASS4_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class5_and_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class5_and_en_pru0" offset="0x434" width="32" description="">
		<bitfield id="RX_CLASS5_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class5_or_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class5_or_en_pru0" offset="0x438" width="32" description="">
		<bitfield id="RX_CLASS5_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class6_and_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class6_and_en_pru0" offset="0x43C" width="32" description="">
		<bitfield id="RX_CLASS6_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class6_or_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class6_or_en_pru0" offset="0x440" width="32" description="">
		<bitfield id="RX_CLASS6_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class7_and_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class7_and_en_pru0" offset="0x444" width="32" description="">
		<bitfield id="RX_CLASS7_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class7_or_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class7_or_en_pru0" offset="0x448" width="32" description="">
		<bitfield id="RX_CLASS7_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class8_and_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class8_and_en_pru0" offset="0x44C" width="32" description="">
		<bitfield id="RX_CLASS8_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
