IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates6_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates6_pru0" offset="0x4AC" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN6" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK6" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK6" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK6" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL6" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates7_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates7_pru0" offset="0x4B0" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN7" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK7" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK7" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK7" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL7" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates8_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates8_pru0" offset="0x4B4" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN8" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK8" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK8" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK8" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL8" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates9_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates9_pru0" offset="0x4B8" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN9" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK9" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK9" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK9" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL9" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates10_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates10_pru0" offset="0x4BC" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN10" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK10" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK10" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK10" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL10" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates11_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates11_pru0" offset="0x4C0" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN11" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK11" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK11" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK11" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL11" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates12_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates12_pru0" offset="0x4C4" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN12" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK12" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK12" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK12" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL12" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates13_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates13_pru0" offset="0x4C8" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN13" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK13" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK13" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK13" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL13" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates14_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates14_pru0" offset="0x4CC" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN14" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK14" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK14" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK14" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL14" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates15_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates15_pru0" offset="0x4D0" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN15" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK15" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK15" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK15" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL15" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
