IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_1_pru0" offset="0x514" width="32" description="">
		<bitfield id="TX_RATE_CIR_IDLE1" width="32" begin="31" end="0" resetval="0x0" description="TX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_1_pru0" offset="0x518" width="32" description="">
		<bitfield id="TX_RATE_ALLOW1" width="1" begin="17" end="17" resetval="0x0" description="TX Rate Pkt Enable" range="17" rwaccess="R"/> 
		<bitfield id="TX_RATE_EN1" width="1" begin="16" end="16" resetval="0x0" description="TX Rate Pkt Enable" range="16" rwaccess="R/W"/> 
		<bitfield id="TX_RATE_LEN1" width="16" begin="15" end="0" resetval="0x0" description="TX Rate Pkt Length " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_2_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_2_pru0" offset="0x51C" width="32" description="">
		<bitfield id="TX_RATE_CIR_IDLE2" width="32" begin="31" end="0" resetval="0x0" description="TX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_2_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_2_pru0" offset="0x520" width="32" description="">
		<bitfield id="TX_RATE_ALLOW2" width="1" begin="17" end="17" resetval="0x0" description="TX Rate Pkt Enable" range="17" rwaccess="R"/> 
		<bitfield id="TX_RATE_EN2" width="1" begin="16" end="16" resetval="0x0" description="TX Rate Pkt Enable" range="16" rwaccess="R/W"/> 
		<bitfield id="TX_RATE_LEN2" width="16" begin="15" end="0" resetval="0x0" description="TX Rate Pkt Length " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_3_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_3_pru0" offset="0x524" width="32" description="">
		<bitfield id="TX_RATE_CIR_IDLE3" width="32" begin="31" end="0" resetval="0x0" description="TX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_3_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_3_pru0" offset="0x528" width="32" description="">
		<bitfield id="TX_RATE_ALLOW3" width="1" begin="17" end="17" resetval="0x0" description="TX Rate Pkt Enable" range="17" rwaccess="R"/> 
		<bitfield id="TX_RATE_EN3" width="1" begin="16" end="16" resetval="0x0" description="TX Rate Pkt Enable" range="16" rwaccess="R/W"/> 
		<bitfield id="TX_RATE_LEN3" width="16" begin="15" end="0" resetval="0x0" description="TX Rate Pkt Length " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_4_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_4_pru0" offset="0x52C" width="32" description="">
		<bitfield id="TX_RATE_CIR_IDLE4" width="32" begin="31" end="0" resetval="0x0" description="TX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_4_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_4_pru0" offset="0x530" width="32" description="">
		<bitfield id="TX_RATE_ALLOW4" width="1" begin="17" end="17" resetval="0x0" description="TX Rate Pkt Enable" range="17" rwaccess="R"/> 
		<bitfield id="TX_RATE_EN4" width="1" begin="16" end="16" resetval="0x0" description="TX Rate Pkt Enable" range="16" rwaccess="R/W"/> 
		<bitfield id="TX_RATE_LEN4" width="16" begin="15" end="0" resetval="0x0" description="TX Rate Pkt Length " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_5_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_5_pru0" offset="0x534" width="32" description="">
		<bitfield id="TX_RATE_CIR_IDLE5" width="32" begin="31" end="0" resetval="0x0" description="TX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_5_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_5_pru0" offset="0x538" width="32" description="">
		<bitfield id="TX_RATE_ALLOW5" width="1" begin="17" end="17" resetval="0x0" description="TX Rate Pkt Enable" range="17" rwaccess="R"/> 
		<bitfield id="TX_RATE_EN5" width="1" begin="16" end="16" resetval="0x0" description="TX Rate Pkt Enable" range="16" rwaccess="R/W"/> 
		<bitfield id="TX_RATE_LEN5" width="16" begin="15" end="0" resetval="0x0" description="TX Rate Pkt Length " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_6_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_6_pru0" offset="0x53C" width="32" description="">
		<bitfield id="TX_RATE_CIR_IDLE6" width="32" begin="31" end="0" resetval="0x0" description="TX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_6_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_6_pru0" offset="0x540" width="32" description="">
		<bitfield id="TX_RATE_ALLOW6" width="1" begin="17" end="17" resetval="0x0" description="TX Rate Pkt Enable" range="17" rwaccess="R"/> 
		<bitfield id="TX_RATE_EN6" width="1" begin="16" end="16" resetval="0x0" description="TX Rate Pkt Enable" range="16" rwaccess="R/W"/> 
		<bitfield id="TX_RATE_LEN6" width="16" begin="15" end="0" resetval="0x0" description="TX Rate Pkt Length " range="15 - 0" rwaccess="R/W"/>
	</register>
