IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bkt5_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bkt5_pru0" offset="0x5E0" width="32" description="">
		<bitfield id="RX_STAT_BKT5" width="16" begin="15" end="0" resetval="0x0" description="RX Bucket5 Frame Count Inc if > than Bucket4 Byte Size" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_total_bytes_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_total_bytes_pru0" offset="0x5E4" width="32" description="">
		<bitfield id="RX_STAT_TOTAL_BYTES_PRU" width="32" begin="31" end="0" resetval="0x0" description="RX Total Byte Count" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rxtx_stat_total_bytes_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rxtx_stat_total_bytes_pru0" offset="0x5E8" width="32" description="">
		<bitfield id="RXTX_STAT_TOTAL_BYTES_PRU" width="32" begin="31" end="0" resetval="0x0" description="RX and TX Total Byte Count" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_good_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_good_port0" offset="0x5EC" width="32" description="">
		<bitfield id="TX_GOOD_FRM_CNT" width="32" begin="31" end="0" resetval="0x0" description="TX Good Frame Count Inc if no min size err max size err or mii odd nibble" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bc_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bc_port0" offset="0x5F0" width="32" description="">
		<bitfield id="TX_BC_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="TX BC Frame Count Inc if BC" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_mc_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_mc_port0" offset="0x5F4" width="32" description="">
		<bitfield id="TX_MC_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="TX MC Frame Count Inc if MC" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_odd_err_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_odd_err_port0" offset="0x5F8" width="32" description="">
		<bitfield id="TX_ODD_ERR_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="TX Odd Nibble Frame Count Inc if mii odd nibble" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_underflow_err_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_underflow_err_port0" offset="0x5FC" width="32" description="">
		<bitfield id="TX_UNDERFLOW_CNT" width="16" begin="15" end="0" resetval="0x0" description="TX MAX Underflow Error Cnt" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_max_size_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_max_size_port0" offset="0x600" width="32" description="">
		<bitfield id="TX_MAX_SIZE_FRM" width="16" begin="15" end="0" resetval="0x2000" description="TX MAX Size Frame Count Limit" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_max_err_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_max_err_port0" offset="0x604" width="32" description="">
		<bitfield id="TX_MAX_ERR_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="TX MAX Size Err Frame Count Inc if > max Limit " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_min_size_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_min_size_port0" offset="0x608" width="32" description="">
		<bitfield id="TX_MIN_SIZE_FRM" width="16" begin="15" end="0" resetval="0x64" description="TX MIN Size Frame Count Limit" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_min_err_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_min_err_port0" offset="0x60C" width="32" description="">
		<bitfield id="TX_MIN_ERR_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="TX MIN Size Err Frame Count Inc if &#60; min Limit" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt1_size_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt1_size_port0" offset="0x610" width="32" description="">
		<bitfield id="TX_STAT_BKT1_SIZE" width="14" begin="13" end="0" resetval="0x64" description="TX Bucket1 Byte Size" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt2_size_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt2_size_port0" offset="0x614" width="32" description="">
		<bitfield id="TX_STAT_BKT2_SIZE" width="14" begin="13" end="0" resetval="0x128" description="TX Bucket2 Byte Size" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt3_size_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt3_size_port0" offset="0x618" width="32" description="">
		<bitfield id="TX_STAT_BKT3_SIZE" width="14" begin="13" end="0" resetval="0x256" description="TX Bucket3 Byte Size" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt4_size_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt4_size_port0" offset="0x61C" width="32" description="">
		<bitfield id="TX_STAT_BKT4_SIZE" width="14" begin="13" end="0" resetval="0x512" description="TX Bucket4 Byte Size" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_64_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_64_port0" offset="0x620" width="32" description="">
		<bitfield id="TX_64_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="TX 64Byte Frame Count Inc if 64B" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt1_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt1_port0" offset="0x624" width="32" description="">
		<bitfield id="TX_STAT_BKT1" width="16" begin="15" end="0" resetval="0x0" description="TX Bucket1 Inc if &#60;= than Bucket1" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt2_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt2_port0" offset="0x628" width="32" description="">
		<bitfield id="TX_STAT_BKT2" width="16" begin="15" end="0" resetval="0x0" description="TX Bucket2 Inc if &#60;= than Bucket2 Byte Size and if > than Bucket1 Byte Size" range="15 - 0" rwaccess="R/W"/>
	</register>
