IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt3_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt3_port0" offset="0x62C" width="32" description="">
		<bitfield id="TX_STAT_BKT3" width="16" begin="15" end="0" resetval="0x0" description="TX Bucket3 Inc if &#60;= than Bucket3 Byte Size and if > than Bucket2 Byte Size" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt4_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt4_port0" offset="0x630" width="32" description="">
		<bitfield id="TX_STAT_BKT4" width="16" begin="15" end="0" resetval="0x0" description="TX Bucket4 Inc if &#60;= than Bucket4 Byte Size and if > than Bucket3 Byte Size" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt5_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt5_port0" offset="0x634" width="32" description="">
		<bitfield id="TX_STAT_BKT5" width="16" begin="15" end="0" resetval="0x0" description="TX Bucket5 Inc if > than Bucket4 Byte Size" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_total_bytes_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_total_bytes_port0" offset="0x638" width="32" description="">
		<bitfield id="TX_TOTAL_STAT_BYTES_PORT" width="32" begin="31" end="0" resetval="0x0" description="TX Total Byte Count of all Frames" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_hsr_tag_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_hsr_tag_port0" offset="0x63C" width="32" description="">
		<bitfield id="TX_HSR_TAG" width="32" begin="31" end="0" resetval="0x35119" description="HSR TAG" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_hsr_seq_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_hsr_seq_port0" offset="0x640" width="32" description="">
		<bitfield id="TX_HSR_SEQ" width="16" begin="15" end="0" resetval="0x0" description="HSR Seq count. It will incr for every HSR type " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_vlan_type_tag_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_vlan_type_tag_port0" offset="0x644" width="32" description="">
		<bitfield id="TX_VLAN_TYPE_TAG" width="16" begin="15" end="0" resetval="0x129" description="TX VLAN Type Tag, match to enable VLAN removal " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_vlan_ins_tag_port0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_vlan_ins_tag_port0" offset="0x648" width="32" description="">
		<bitfield id="TX_VLAN_INS_TAG" width="32" begin="31" end="0" resetval="0x1" description="TX VLAN Insertion " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_start_len_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_start_len_pru1" offset="0x64C" width="32" description="">
		<bitfield id="FT1_LEN" width="4" begin="19" end="16" resetval="0x6" description="Defines the total number of Bytes Filter1 will check before Valid bit is set" range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="FT1_START" width="15" begin="14" end="0" resetval="0x0" description="Byte count start for Filter1. Any wrt will clear all Filter1 Status Bits" range="14 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_cfg_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_cfg_pru1" offset="0x650" width="32" description="">
		<bitfield id="FT1_7CFG" width="2" begin="15" end="14" resetval="0x1" description="0: Disabled  1: EQ   2: GT  3: LT" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="FT1_6CFG" width="2" begin="13" end="12" resetval="0x1" description="0: Disabled  1: EQ   2: GT  3: LT" range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="FT1_5CFG" width="2" begin="11" end="10" resetval="0x1" description="0: Disabled  1: EQ   2: GT  3: LT" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="FT1_4CFG" width="2" begin="9" end="8" resetval="0x1" description="0: Disabled  1: EQ   2: GT  3: LT" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="FT1_3CFG" width="2" begin="7" end="6" resetval="0x1" description="0: Disabled  1: EQ   2: GT  3: LT" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="FT1_2CFG" width="2" begin="5" end="4" resetval="0x1" description="0: Disabled  1: EQ   2: GT  3: LT" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="FT1_1CFG" width="2" begin="3" end="2" resetval="0x1" description="0: Disabled  1: EQ   2: GT  3: LT" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="FT1_0CFG" width="2" begin="1" end="0" resetval="0x1" description="0: Disabled  1: EQ   2: GT  3: LT" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_0_da0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_0_da0_pru1" offset="0x654" width="32" description="">
		<bitfield id="FT1_0_DA0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 DA4:DA1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_0_da1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_0_da1_pru1" offset="0x658" width="32" description="">
		<bitfield id="FT1_0_DA1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 DA6:DA5  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_0_da_mask0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_0_da_mask0_pru1" offset="0x65C" width="32" description="">
		<bitfield id="FT1_0_DA_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 MDA4:MDA1  set to 1 to mask that bit " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_0_da_mask1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_0_da_mask1_pru1" offset="0x660" width="32" description="">
		<bitfield id="FT1_0_DA_MASK1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 MDA6:MDA5  set to 1 to mask that bit  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_1_da0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_1_da0_pru1" offset="0x664" width="32" description="">
		<bitfield id="FT1_1_DA0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 DA4:DA1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_1_da1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_1_da1_pru1" offset="0x668" width="32" description="">
		<bitfield id="FT1_1_DA1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 DA6:DA5  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_1_da_mask0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_1_da_mask0_pru1" offset="0x66C" width="32" description="">
		<bitfield id="FT1_1_DA_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 MDA4:MDA1  set to 1 to mask that bit " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_1_da_mask1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_1_da_mask1_pru1" offset="0x670" width="32" description="">
		<bitfield id="FT1_1_DA_MASK1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 MDA6:MDA5  set to 1 to mask that bit  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_2_da0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_2_da0_pru1" offset="0x674" width="32" description="">
		<bitfield id="FT1_2_DA0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 DA4:DA1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_2_da1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_2_da1_pru1" offset="0x678" width="32" description="">
		<bitfield id="FT1_2_DA1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 DA6:DA5  " range="15 - 0" rwaccess="R/W"/>
	</register>
