IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_2_da_mask0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_2_da_mask0_pru1" offset="0x67C" width="32" description="">
		<bitfield id="FT1_2_DA_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 MDA4:MDA1  set to 1 to mask that bit " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_2_da_mask1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_2_da_mask1_pru1" offset="0x680" width="32" description="">
		<bitfield id="FT1_2_DA_MASK1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 MDA6:MDA5  set to 1 to mask that bit  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_3_da0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_3_da0_pru1" offset="0x684" width="32" description="">
		<bitfield id="FT1_3_DA0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 DA4:DA1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_3_da1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_3_da1_pru1" offset="0x688" width="32" description="">
		<bitfield id="FT1_3_DA1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 DA6:DA5  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_3_da_mask0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_3_da_mask0_pru1" offset="0x68C" width="32" description="">
		<bitfield id="FT1_3_DA_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 MDA4:MDA1  set to 1 to mask that bit " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_3_da_mask1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_3_da_mask1_pru1" offset="0x690" width="32" description="">
		<bitfield id="FT1_3_DA_MASK1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 MDA6:MDA5  set to 1 to mask that bit  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_4_da0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_4_da0_pru1" offset="0x694" width="32" description="">
		<bitfield id="FT1_4_DA0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 DA4:DA1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_4_da1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_4_da1_pru1" offset="0x698" width="32" description="">
		<bitfield id="FT1_4_DA1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 DA6:DA5  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_4_da_mask0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_4_da_mask0_pru1" offset="0x69C" width="32" description="">
		<bitfield id="FT1_4_DA_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 MDA4:MDA1  set to 1 to mask that bit " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_4_da_mask1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_4_da_mask1_pru1" offset="0x6A0" width="32" description="">
		<bitfield id="FT1_4_DA_MASK1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 MDA6:MDA5  set to 1 to mask that bit  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_5_da0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_5_da0_pru1" offset="0x6A4" width="32" description="">
		<bitfield id="FT1_5_DA0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 DA4:DA1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_5_da1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_5_da1_pru1" offset="0x6A8" width="32" description="">
		<bitfield id="FT1_5_DA1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 DA6:DA5  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_5_da_mask0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_5_da_mask0_pru1" offset="0x6AC" width="32" description="">
		<bitfield id="FT1_5_DA_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 MDA4:MDA1  set to 1 to mask that bit " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_5_da_mask1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_5_da_mask1_pru1" offset="0x6B0" width="32" description="">
		<bitfield id="FT1_5_DA_MASK1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 MDA6:MDA5  set to 1 to mask that bit  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_6_da0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_6_da0_pru1" offset="0x6B4" width="32" description="">
		<bitfield id="FT1_6_DA0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 DA4:DA1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_6_da1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_6_da1_pru1" offset="0x6B8" width="32" description="">
		<bitfield id="FT1_6_DA1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 DA6:DA5  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_6_da_mask0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_6_da_mask0_pru1" offset="0x6BC" width="32" description="">
		<bitfield id="FT1_6_DA_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 MDA4:MDA1  set to 1 to mask that bit " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_6_da_mask1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_6_da_mask1_pru1" offset="0x6C0" width="32" description="">
		<bitfield id="FT1_6_DA_MASK1" width="16" begin="15" end="0" resetval="0x0" description="Filter1 MDA6:MDA5  set to 1 to mask that bit  " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_7_da0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft1_7_da0_pru1" offset="0x6C4" width="32" description="">
		<bitfield id="FT1_7_DA0" width="32" begin="31" end="0" resetval="0x0" description="Filter1 DA4:DA1  " range="31 - 0" rwaccess="R/W"/>
	</register>
