IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_3_t_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_3_t_pru1" offset="0x74C" width="32" description="">
		<bitfield id="FT3_3_T" width="32" begin="31" end="0" resetval="0x0" description="Filter3 T4:T1  Note if Auto Skip is enabled then Type filter is not enabled" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_3_t_mask_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_3_t_mask_pru1" offset="0x750" width="32" description="">
		<bitfield id="FT3_3_T_MASK" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MT4:MT1   Note if Auto Skip is enabled then Type filter is not enabled   set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_start_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_start_pru1" offset="0x754" width="32" description="">
		<bitfield id="FT3_START" width="15" begin="14" end="0" resetval="0x12" description="Byte count start for Filter3. Any wrt will clear all Filter3 Status Bits SW can read to determine next start during Auto " range="14 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_start_auto_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_start_auto_pru1" offset="0x758" width="32" description="">
		<bitfield id="FT3_START_AUTO" width="15" begin="14" end="0" resetval="0x0" description="Byte count start for Auto skip mode" range="14 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_start_len_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_start_len_pru1" offset="0x75C" width="32" description="">
		<bitfield id="FT3_OFFSET_END" width="3" begin="22" end="20" resetval="0x0" description="Defines which byte within FT3_[N]P[63:0] to end the compare at set the Valid flag,  rule ft3_offset_end >= ft3_offset_start To disable pattern compare set start and end to zero " range="22 - 20" rwaccess="R/W"/> 
		<bitfield id="FT3_OFFSET_START" width="3" begin="18" end="16" resetval="0x0" description="Defines which byte within FT3_[N]P[63:0] to start the compare " range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_OFFSET" width="15" begin="14" end="0" resetval="0x0" description="Determine which byte to start FT3_[N]P[63:0] operation it will start on the next byte after FT3_T completes if set to zero " range="14 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_jmp_offset_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_jmp_offset_pru1" offset="0x760" width="32" description="">
		<bitfield id="FT3_4_NJMP_OFFSET_PRU1" width="15" begin="30" end="16" resetval="0x0" description="Defines the Next Offset to compare when auto arm jump is enabled" range="30 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_4_IJMP_OFFSET_PRU1" width="15" begin="14" end="0" resetval="0x0" description="Defines the Intial Offset to compare when auto arm jump is enabled " range="14 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_len_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_len_pru1" offset="0x764" width="32" description="">
		<bitfield id="FT3_4_LEN_BIG_EN_PRU1" width="1" begin="24" end="24" resetval="0x0" description="Enable Big Indian on Length" range="24" rwaccess="R/W"/> 
		<bitfield id="FT3_4_LEN_SIZE_BIT_PRU1" width="4" begin="19" end="16" resetval="0x0" description="Defines number of bits to extract the length for the auto skip function" range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_4_LEN_START_BIT_PRU1" width="9" begin="8" end="0" resetval="0x0" description="Defines relative bit offset from the HIT byte location upto 512 bit offset the exraction to determine the on the fly length byte offset" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_cfg_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_cfg_pru1" offset="0x768" width="32" description="">
		<bitfield id="FT3_4_TRIG_OR_EN" width="16" begin="31" end="16" resetval="0x0" description="Trigger ft3 select for auto skip enable, if one or more set the function is enabled note you can not slect the same ft3 only others" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_4_VLAN_SKIP_EN" width="1" begin="2" end="2" resetval="0x1" description="0: Disabled  1: Enable" range="2" rwaccess="R/W"/> 
		<bitfield id="FT3_4CFG" width="2" begin="1" end="0" resetval="0x1" description="0: Disabled  1: EQ  2: GT  3: LT" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_t_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_t_pru1" offset="0x76C" width="32" description="">
		<bitfield id="FT3_4_T" width="32" begin="31" end="0" resetval="0x0" description="Filter3 T4:T1  Note if Auto Skip is enabled then Type filter is not enabled" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_t_mask_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_4_t_mask_pru1" offset="0x770" width="32" description="">
		<bitfield id="FT3_4_T_MASK" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MT4:MT1   Note if Auto Skip is enabled then Type filter is not enabled   set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_start_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_start_pru1" offset="0x774" width="32" description="">
		<bitfield id="FT3_START" width="15" begin="14" end="0" resetval="0x12" description="Byte count start for Filter3. Any wrt will clear all Filter3 Status Bits SW can read to determine next start during Auto " range="14 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_start_auto_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_start_auto_pru1" offset="0x778" width="32" description="">
		<bitfield id="FT3_START_AUTO" width="15" begin="14" end="0" resetval="0x0" description="Byte count start for Auto skip mode" range="14 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_start_len_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_start_len_pru1" offset="0x77C" width="32" description="">
		<bitfield id="FT3_OFFSET_END" width="3" begin="22" end="20" resetval="0x0" description="Defines which byte within FT3_[N]P[63:0] to end the compare at set the Valid flag,  rule ft3_offset_end >= ft3_offset_start To disable pattern compare set start and end to zero " range="22 - 20" rwaccess="R/W"/> 
		<bitfield id="FT3_OFFSET_START" width="3" begin="18" end="16" resetval="0x0" description="Defines which byte within FT3_[N]P[63:0] to start the compare " range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_OFFSET" width="15" begin="14" end="0" resetval="0x0" description="Determine which byte to start FT3_[N]P[63:0] operation it will start on the next byte after FT3_T completes if set to zero " range="14 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_jmp_offset_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_jmp_offset_pru1" offset="0x780" width="32" description="">
		<bitfield id="FT3_5_NJMP_OFFSET_PRU1" width="15" begin="30" end="16" resetval="0x0" description="Defines the Next Offset to compare when auto arm jump is enabled" range="30 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_5_IJMP_OFFSET_PRU1" width="15" begin="14" end="0" resetval="0x0" description="Defines the Intial Offset to compare when auto arm jump is enabled " range="14 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_len_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_len_pru1" offset="0x784" width="32" description="">
		<bitfield id="FT3_5_LEN_BIG_EN_PRU1" width="1" begin="24" end="24" resetval="0x0" description="Enable Big Indian on Length" range="24" rwaccess="R/W"/> 
		<bitfield id="FT3_5_LEN_SIZE_BIT_PRU1" width="4" begin="19" end="16" resetval="0x0" description="Defines number of bits to extract the length for the auto skip function" range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_5_LEN_START_BIT_PRU1" width="9" begin="8" end="0" resetval="0x0" description="Defines relative bit offset from the HIT byte location upto 512 bit offset the exraction to determine the on the fly length byte offset" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_cfg_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_cfg_pru1" offset="0x788" width="32" description="">
		<bitfield id="FT3_5_TRIG_OR_EN" width="16" begin="31" end="16" resetval="0x0" description="Trigger ft3 select for auto skip enable, if one or more set the function is enabled note you can not slect the same ft3 only others" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_5_VLAN_SKIP_EN" width="1" begin="2" end="2" resetval="0x1" description="0: Disabled  1: Enable" range="2" rwaccess="R/W"/> 
		<bitfield id="FT3_5CFG" width="2" begin="1" end="0" resetval="0x1" description="0: Disabled  1: EQ  2: GT  3: LT" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_t_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_t_pru1" offset="0x78C" width="32" description="">
		<bitfield id="FT3_5_T" width="32" begin="31" end="0" resetval="0x0" description="Filter3 T4:T1  Note if Auto Skip is enabled then Type filter is not enabled" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_t_mask_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_5_t_mask_pru1" offset="0x790" width="32" description="">
		<bitfield id="FT3_5_T_MASK" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MT4:MT1   Note if Auto Skip is enabled then Type filter is not enabled   set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_start_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_start_pru1" offset="0x794" width="32" description="">
		<bitfield id="FT3_START" width="15" begin="14" end="0" resetval="0x12" description="Byte count start for Filter3. Any wrt will clear all Filter3 Status Bits SW can read to determine next start during Auto " range="14 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_start_auto_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_start_auto_pru1" offset="0x798" width="32" description="">
		<bitfield id="FT3_START_AUTO" width="15" begin="14" end="0" resetval="0x0" description="Byte count start for Auto skip mode" range="14 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_start_len_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_start_len_pru1" offset="0x79C" width="32" description="">
		<bitfield id="FT3_OFFSET_END" width="3" begin="22" end="20" resetval="0x0" description="Defines which byte within FT3_[N]P[63:0] to end the compare at set the Valid flag,  rule ft3_offset_end >= ft3_offset_start To disable pattern compare set start and end to zero " range="22 - 20" rwaccess="R/W"/> 
		<bitfield id="FT3_OFFSET_START" width="3" begin="18" end="16" resetval="0x0" description="Defines which byte within FT3_[N]P[63:0] to start the compare " range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_OFFSET" width="15" begin="14" end="0" resetval="0x0" description="Determine which byte to start FT3_[N]P[63:0] operation it will start on the next byte after FT3_T completes if set to zero " range="14 - 0" rwaccess="R/W"/>
	</register>
