IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_14_t_mask_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_14_t_mask_pru1" offset="0x8B0" width="32" description="">
		<bitfield id="FT3_14_T_MASK" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MT4:MT1   Note if Auto Skip is enabled then Type filter is not enabled   set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_start_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_start_pru1" offset="0x8B4" width="32" description="">
		<bitfield id="FT3_START" width="15" begin="14" end="0" resetval="0x12" description="Byte count start for Filter3. Any wrt will clear all Filter3 Status Bits SW can read to determine next start during Auto " range="14 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_start_auto_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_start_auto_pru1" offset="0x8B8" width="32" description="">
		<bitfield id="FT3_START_AUTO" width="15" begin="14" end="0" resetval="0x0" description="Byte count start for Auto skip mode" range="14 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_start_len_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_start_len_pru1" offset="0x8BC" width="32" description="">
		<bitfield id="FT3_OFFSET_END" width="3" begin="22" end="20" resetval="0x0" description="Defines which byte within FT3_[N]P[63:0] to end the compare at set the Valid flag,  rule ft3_offset_end >= ft3_offset_start To disable pattern compare set start and end to zero " range="22 - 20" rwaccess="R/W"/> 
		<bitfield id="FT3_OFFSET_START" width="3" begin="18" end="16" resetval="0x0" description="Defines which byte within FT3_[N]P[63:0] to start the compare " range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_OFFSET" width="15" begin="14" end="0" resetval="0x0" description="Determine which byte to start FT3_[N]P[63:0] operation it will start on the next byte after FT3_T completes if set to zero " range="14 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_jmp_offset_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_jmp_offset_pru1" offset="0x8C0" width="32" description="">
		<bitfield id="FT3_15_NJMP_OFFSET_PRU1" width="15" begin="30" end="16" resetval="0x0" description="Defines the Next Offset to compare when auto arm jump is enabled" range="30 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_15_IJMP_OFFSET_PRU1" width="15" begin="14" end="0" resetval="0x0" description="Defines the Intial Offset to compare when auto arm jump is enabled " range="14 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_len_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_len_pru1" offset="0x8C4" width="32" description="">
		<bitfield id="FT3_15_LEN_BIG_EN_PRU1" width="1" begin="24" end="24" resetval="0x0" description="Enable Big Indian on Length" range="24" rwaccess="R/W"/> 
		<bitfield id="FT3_15_LEN_SIZE_BIT_PRU1" width="4" begin="19" end="16" resetval="0x0" description="Defines number of bits to extract the length for the auto skip function" range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_15_LEN_START_BIT_PRU1" width="9" begin="8" end="0" resetval="0x0" description="Defines relative bit offset from the HIT byte location upto 512 bit offset the exraction to determine the on the fly length byte offset" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_cfg_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_cfg_pru1" offset="0x8C8" width="32" description="">
		<bitfield id="FT3_15_TRIG_OR_EN" width="16" begin="31" end="16" resetval="0x0" description="Trigger ft3 select for auto skip enable, if one or more set the function is enabled note you can not slect the same ft3 only others" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="FT3_15_VLAN_SKIP_EN" width="1" begin="2" end="2" resetval="0x1" description="0: Disabled  1: Enable" range="2" rwaccess="R/W"/> 
		<bitfield id="FT3_15CFG" width="2" begin="1" end="0" resetval="0x1" description="0: Disabled  1: EQ  2: GT  3: LT" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_t_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_t_pru1" offset="0x8CC" width="32" description="">
		<bitfield id="FT3_15_T" width="32" begin="31" end="0" resetval="0x0" description="Filter3 T4:T1  Note if Auto Skip is enabled then Type filter is not enabled" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_t_mask_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_t_mask_pru1" offset="0x8D0" width="32" description="">
		<bitfield id="FT3_15_T_MASK" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MT4:MT1   Note if Auto Skip is enabled then Type filter is not enabled   set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_0_p0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_0_p0_pru1" offset="0x8D4" width="32" description="">
		<bitfield id="FT3_0_P0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P4:P1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_0_p1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_0_p1_pru1" offset="0x8D8" width="32" description="">
		<bitfield id="FT3_0_P1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P8:P5  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_0_p_mask0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_0_p_mask0_pru1" offset="0x8DC" width="32" description="">
		<bitfield id="FT3_0_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_0_p_mask1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_0_p_mask1_pru1" offset="0x8E0" width="32" description="">
		<bitfield id="FT3_0_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_1_p0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_1_p0_pru1" offset="0x8E4" width="32" description="">
		<bitfield id="FT3_1_P0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P4:P1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_1_p1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_1_p1_pru1" offset="0x8E8" width="32" description="">
		<bitfield id="FT3_1_P1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P8:P5  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_1_p_mask0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_1_p_mask0_pru1" offset="0x8EC" width="32" description="">
		<bitfield id="FT3_1_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_1_p_mask1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_1_p_mask1_pru1" offset="0x8F0" width="32" description="">
		<bitfield id="FT3_1_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
