IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class11_and_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class11_and_en_pru1" offset="0xA30" width="32" description="">
		<bitfield id="RX_CLASS11_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class11_or_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class11_or_en_pru1" offset="0xA34" width="32" description="">
		<bitfield id="RX_CLASS11_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class12_and_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class12_and_en_pru1" offset="0xA38" width="32" description="">
		<bitfield id="RX_CLASS12_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class12_or_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class12_or_en_pru1" offset="0xA3C" width="32" description="">
		<bitfield id="RX_CLASS12_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class13_and_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class13_and_en_pru1" offset="0xA40" width="32" description="">
		<bitfield id="RX_CLASS13_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class13_or_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class13_or_en_pru1" offset="0xA44" width="32" description="">
		<bitfield id="RX_CLASS13_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class14_and_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class14_and_en_pru1" offset="0xA48" width="32" description="">
		<bitfield id="RX_CLASS14_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class14_or_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class14_or_en_pru1" offset="0xA4C" width="32" description="">
		<bitfield id="RX_CLASS14_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class15_and_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class15_and_en_pru1" offset="0xA50" width="32" description="">
		<bitfield id="RX_CLASS15_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class15_or_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class15_or_en_pru1" offset="0xA54" width="32" description="">
		<bitfield id="RX_CLASS15_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_cfg1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_cfg1_pru1" offset="0xA58" width="32" description="">
		<bitfield id="RX_CLASS15_SEL" width="2" begin="31" end="30" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="31 - 30" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS14_SEL" width="2" begin="29" end="28" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="29 - 28" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS13_SEL" width="2" begin="27" end="26" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="27 - 26" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS12_SEL" width="2" begin="25" end="24" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS11_SEL" width="2" begin="23" end="22" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="23 - 22" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS10_SEL" width="2" begin="21" end="20" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="21 - 20" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS9_SEL" width="2" begin="19" end="18" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="19 - 18" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS8_SEL" width="2" begin="17" end="16" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS7_SEL" width="2" begin="15" end="14" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS6_SEL" width="2" begin="13" end="12" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS5_SEL" width="2" begin="11" end="10" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS4_SEL" width="2" begin="9" end="8" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS3_SEL" width="2" begin="7" end="6" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS2_SEL" width="2" begin="5" end="4" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS1_SEL" width="2" begin="3" end="2" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS0_SEL" width="2" begin="1" end="0" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_cfg2_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_cfg2_pru1" offset="0xA5C" width="32" description="">
		<bitfield id="RX_CLASS_OR_NV" width="16" begin="31" end="16" resetval="0x0" description="rx class or nv enable   " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_AND_NV" width="16" begin="15" end="0" resetval="0x0" description="rx class and nv enable   " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates0_pru1" offset="0xA60" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN0" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK0" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK0" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK0" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL0" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates1_pru1" offset="0xA64" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN1" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK1" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK1" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK1" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL1" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates2_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates2_pru1" offset="0xA68" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN2" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK2" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK2" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK2" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL2" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates3_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates3_pru1" offset="0xA6C" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN3" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK3" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK3" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK3" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL3" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates4_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates4_pru1" offset="0xA70" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN4" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK4" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK4" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK4" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL4" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates5_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates5_pru1" offset="0xA74" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN5" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK5" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK5" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK5" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL5" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates6_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates6_pru1" offset="0xA78" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN6" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK6" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK6" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK6" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL6" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates7_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates7_pru1" offset="0xA7C" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN7" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK7" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK7" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK7" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL7" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates8_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates8_pru1" offset="0xA80" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN8" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK8" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK8" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK8" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL8" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates9_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates9_pru1" offset="0xA84" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN9" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK9" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK9" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK9" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL9" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates10_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates10_pru1" offset="0xA88" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN10" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK10" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK10" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK10" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL10" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates11_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates11_pru1" offset="0xA8C" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN11" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK11" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK11" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK11" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL11" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates12_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates12_pru1" offset="0xA90" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN12" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK12" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK12" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK12" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL12" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates13_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates13_pru1" offset="0xA94" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN13" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK13" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK13" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK13" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL13" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates14_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates14_pru1" offset="0xA98" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN14" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK14" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK14" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK14" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL14" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
