IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates15_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates15_pru1" offset="0xA9C" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN15" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK15" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK15" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK15" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL15" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_green_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_green_pru1" offset="0xAA0" width="32" description="">
		<bitfield id="RX_GREEN_VAL" width="1" begin="4" end="4" resetval="0x0" description="0 RED 1 GREEN status " range="4" rwaccess="R"/> 
		<bitfield id="RX_GREEN_CMP_SEL" width="4" begin="3" end="0" resetval="0x0" description="define which IEP CMP start green   " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_sa_hash_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_sa_hash_pru1" offset="0xAA4" width="32" description="">
		<bitfield id="SA_HASH_SEED" width="10" begin="9" end="0" resetval="0x0" description="SA Hash Seed" range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_conn_hash_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_conn_hash_pru1" offset="0xAA8" width="32" description="">
		<bitfield id="CONN_HASH_SEED" width="10" begin="9" end="0" resetval="0x0" description="Connection Hash Seed" range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_conn_hash_start_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_conn_hash_start_pru1" offset="0xAAC" width="32" description="">
		<bitfield id="CONN_HASH_START" width="15" begin="14" end="0" resetval="0x0" description="Connection Hash Start which 4 Bytes to hash" range="14 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg0_pru1" offset="0xAB0" width="32" description="">
		<bitfield id="RX_RATE_CIR_IDLE0" width="32" begin="31" end="0" resetval="0x0" description="RX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg1_pru1" offset="0xAB4" width="32" description="">
		<bitfield id="RX_RATE_CIR_IDLE1" width="32" begin="31" end="0" resetval="0x0" description="RX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg2_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg2_pru1" offset="0xAB8" width="32" description="">
		<bitfield id="RX_RATE_CIR_IDLE2" width="32" begin="31" end="0" resetval="0x0" description="RX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg3_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg3_pru1" offset="0xABC" width="32" description="">
		<bitfield id="RX_RATE_CIR_IDLE3" width="32" begin="31" end="0" resetval="0x0" description="RX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg4_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg4_pru1" offset="0xAC0" width="32" description="">
		<bitfield id="RX_RATE_CIR_IDLE4" width="32" begin="31" end="0" resetval="0x0" description="RX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg5_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg5_pru1" offset="0xAC4" width="32" description="">
		<bitfield id="RX_RATE_CIR_IDLE5" width="32" begin="31" end="0" resetval="0x0" description="RX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg6_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg6_pru1" offset="0xAC8" width="32" description="">
		<bitfield id="RX_RATE_CIR_IDLE6" width="32" begin="31" end="0" resetval="0x0" description="RX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
