IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_3_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_3_pru1" offset="0xAF4" width="32" description="">
		<bitfield id="TX_RATE_ALLOW3" width="1" begin="17" end="17" resetval="0x0" description="TX Rate Pkt Enable" range="17" rwaccess="R"/> 
		<bitfield id="TX_RATE_EN3" width="1" begin="16" end="16" resetval="0x0" description="TX Rate Pkt Enable" range="16" rwaccess="R/W"/> 
		<bitfield id="TX_RATE_LEN3" width="16" begin="15" end="0" resetval="0x0" description="TX Rate Pkt Length " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_4_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_4_pru1" offset="0xAF8" width="32" description="">
		<bitfield id="TX_RATE_CIR_IDLE4" width="32" begin="31" end="0" resetval="0x0" description="TX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_4_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_4_pru1" offset="0xAFC" width="32" description="">
		<bitfield id="TX_RATE_ALLOW4" width="1" begin="17" end="17" resetval="0x0" description="TX Rate Pkt Enable" range="17" rwaccess="R"/> 
		<bitfield id="TX_RATE_EN4" width="1" begin="16" end="16" resetval="0x0" description="TX Rate Pkt Enable" range="16" rwaccess="R/W"/> 
		<bitfield id="TX_RATE_LEN4" width="16" begin="15" end="0" resetval="0x0" description="TX Rate Pkt Length " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_5_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_5_pru1" offset="0xB00" width="32" description="">
		<bitfield id="TX_RATE_CIR_IDLE5" width="32" begin="31" end="0" resetval="0x0" description="TX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_5_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_5_pru1" offset="0xB04" width="32" description="">
		<bitfield id="TX_RATE_ALLOW5" width="1" begin="17" end="17" resetval="0x0" description="TX Rate Pkt Enable" range="17" rwaccess="R"/> 
		<bitfield id="TX_RATE_EN5" width="1" begin="16" end="16" resetval="0x0" description="TX Rate Pkt Enable" range="16" rwaccess="R/W"/> 
		<bitfield id="TX_RATE_LEN5" width="16" begin="15" end="0" resetval="0x0" description="TX Rate Pkt Length " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_6_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_6_pru1" offset="0xB08" width="32" description="">
		<bitfield id="TX_RATE_CIR_IDLE6" width="32" begin="31" end="0" resetval="0x0" description="TX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_6_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_6_pru1" offset="0xB0C" width="32" description="">
		<bitfield id="TX_RATE_ALLOW6" width="1" begin="17" end="17" resetval="0x0" description="TX Rate Pkt Enable" range="17" rwaccess="R"/> 
		<bitfield id="TX_RATE_EN6" width="1" begin="16" end="16" resetval="0x0" description="TX Rate Pkt Enable" range="16" rwaccess="R/W"/> 
		<bitfield id="TX_RATE_LEN6" width="16" begin="15" end="0" resetval="0x0" description="TX Rate Pkt Length " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_7_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_7_pru1" offset="0xB10" width="32" description="">
		<bitfield id="TX_RATE_CIR_IDLE7" width="32" begin="31" end="0" resetval="0x0" description="TX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_7_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_7_pru1" offset="0xB14" width="32" description="">
		<bitfield id="TX_RATE_ALLOW7" width="1" begin="17" end="17" resetval="0x0" description="TX Rate Pkt Enable" range="17" rwaccess="R"/> 
		<bitfield id="TX_RATE_EN7" width="1" begin="16" end="16" resetval="0x0" description="TX Rate Pkt Enable" range="16" rwaccess="R/W"/> 
		<bitfield id="TX_RATE_LEN7" width="16" begin="15" end="0" resetval="0x0" description="TX Rate Pkt Length " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_good_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_good_pru1" offset="0xB18" width="32" description="">
		<bitfield id="RX_GOOD_FRM_CNT" width="32" begin="31" end="0" resetval="0x0" description="RX Good Frame Count Inc on none min err max err crc err odd err, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bc_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bc_pru1" offset="0xB1C" width="32" description="">
		<bitfield id="RX_BC_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="RX BC Frame Count Inc on BC type, Wrt subtracts" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_mc_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_mc_pru1" offset="0xB20" width="32" description="">
		<bitfield id="RX_MC_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="RX MC Frame Count Inc on MC type, Wrt subtracts" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_crc_err_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_crc_err_pru1" offset="0xB24" width="32" description="">
		<bitfield id="RX_CRC_ERR_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="RX CRC Err Frame Count Inc on crc err, Wrt subtracts" range="15 - 0" rwaccess="R/W"/>
	</register>
