IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rxtx_stat_total_bytes_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rxtx_stat_total_bytes_pru1" offset="0xBB4" width="32" description="">
		<bitfield id="RXTX_STAT_TOTAL_BYTES_PRU" width="32" begin="31" end="0" resetval="0x0" description="RX and TX Total Byte Count" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_good_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_good_port1" offset="0xBB8" width="32" description="">
		<bitfield id="TX_GOOD_FRM_CNT" width="32" begin="31" end="0" resetval="0x0" description="TX Good Frame Count Inc if no min size err max size err or mii odd nibble" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bc_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bc_port1" offset="0xBBC" width="32" description="">
		<bitfield id="TX_BC_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="TX BC Frame Count Inc if BC" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_mc_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_mc_port1" offset="0xBC0" width="32" description="">
		<bitfield id="TX_MC_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="TX MC Frame Count Inc if MC" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_odd_err_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_odd_err_port1" offset="0xBC4" width="32" description="">
		<bitfield id="TX_ODD_ERR_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="TX Odd Nibble Frame Count Inc if mii odd nibble" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_underflow_err_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_underflow_err_port1" offset="0xBC8" width="32" description="">
		<bitfield id="TX_UNDERFLOW_CNT" width="16" begin="15" end="0" resetval="0x0" description="TX MAX Underflow Error Cnt" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_max_size_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_max_size_port1" offset="0xBCC" width="32" description="">
		<bitfield id="TX_MAX_SIZE_FRM" width="16" begin="15" end="0" resetval="0x2000" description="TX MAX Size Frame Count Limit" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_max_err_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_max_err_port1" offset="0xBD0" width="32" description="">
		<bitfield id="TX_MAX_ERR_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="TX MAX Size Err Frame Count Inc if > max Limit " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_min_size_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_min_size_port1" offset="0xBD4" width="32" description="">
		<bitfield id="TX_MIN_SIZE_FRM" width="16" begin="15" end="0" resetval="0x64" description="TX MIN Size Frame Count Limit" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_min_err_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_min_err_port1" offset="0xBD8" width="32" description="">
		<bitfield id="TX_MIN_ERR_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="TX MIN Size Err Frame Count Inc if &#60; min Limit" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt1_size_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt1_size_port1" offset="0xBDC" width="32" description="">
		<bitfield id="TX_STAT_BKT1_SIZE" width="14" begin="13" end="0" resetval="0x64" description="TX Bucket1 Byte Size" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt2_size_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt2_size_port1" offset="0xBE0" width="32" description="">
		<bitfield id="TX_STAT_BKT2_SIZE" width="14" begin="13" end="0" resetval="0x128" description="TX Bucket2 Byte Size" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt3_size_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt3_size_port1" offset="0xBE4" width="32" description="">
		<bitfield id="TX_STAT_BKT3_SIZE" width="14" begin="13" end="0" resetval="0x256" description="TX Bucket3 Byte Size" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt4_size_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt4_size_port1" offset="0xBE8" width="32" description="">
		<bitfield id="TX_STAT_BKT4_SIZE" width="14" begin="13" end="0" resetval="0x512" description="TX Bucket4 Byte Size" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_64_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_64_port1" offset="0xBEC" width="32" description="">
		<bitfield id="TX_64_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="TX 64Byte Frame Count Inc if 64B" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt1_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt1_port1" offset="0xBF0" width="32" description="">
		<bitfield id="TX_STAT_BKT1" width="16" begin="15" end="0" resetval="0x0" description="TX Bucket1 Inc if &#60;= than Bucket1" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt2_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt2_port1" offset="0xBF4" width="32" description="">
		<bitfield id="TX_STAT_BKT2" width="16" begin="15" end="0" resetval="0x0" description="TX Bucket2 Inc if &#60;= than Bucket2 Byte Size and if > than Bucket1 Byte Size" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt3_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt3_port1" offset="0xBF8" width="32" description="">
		<bitfield id="TX_STAT_BKT3" width="16" begin="15" end="0" resetval="0x0" description="TX Bucket3 Inc if &#60;= than Bucket3 Byte Size and if > than Bucket2 Byte Size" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt4_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt4_port1" offset="0xBFC" width="32" description="">
		<bitfield id="TX_STAT_BKT4" width="16" begin="15" end="0" resetval="0x0" description="TX Bucket4 Inc if &#60;= than Bucket4 Byte Size and if > than Bucket3 Byte Size" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt5_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_bkt5_port1" offset="0xC00" width="32" description="">
		<bitfield id="TX_STAT_BKT5" width="16" begin="15" end="0" resetval="0x0" description="TX Bucket5 Inc if > than Bucket4 Byte Size" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_total_bytes_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_stat_total_bytes_port1" offset="0xC04" width="32" description="">
		<bitfield id="TX_TOTAL_STAT_BYTES_PORT" width="32" begin="31" end="0" resetval="0x0" description="TX Total Byte Count of all Frames" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_hsr_tag_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_hsr_tag_port1" offset="0xC08" width="32" description="">
		<bitfield id="TX_HSR_TAG" width="32" begin="31" end="0" resetval="0x35119" description="HSR TAG" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_hsr_seq_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_hsr_seq_port1" offset="0xC0C" width="32" description="">
		<bitfield id="TX_HSR_SEQ" width="16" begin="15" end="0" resetval="0x0" description="HSR Seq count. It will incr for every HSR type " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_vlan_type_tag_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_vlan_type_tag_port1" offset="0xC10" width="32" description="">
		<bitfield id="TX_VLAN_TYPE_TAG" width="16" begin="15" end="0" resetval="0x129" description="TX VLAN Type Tag, match to enable VLAN removal " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_vlan_ins_tag_port1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_vlan_ins_tag_port1" offset="0xC14" width="32" description="">
		<bitfield id="TX_VLAN_INS_TAG" width="32" begin="31" end="0" resetval="0x1" description="TX VLAN Insertion " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue0" offset="0xD00" width="32" description="">
		<bitfield id="QUEUE_H_PTR0" width="16" begin="15" end="0" resetval="0x0" description="Queue 0" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue1" offset="0xD04" width="32" description="">
		<bitfield id="QUEUE_H_PTR1" width="16" begin="15" end="0" resetval="0x0" description="Queue 1" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue2" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue2" offset="0xD08" width="32" description="">
		<bitfield id="QUEUE_H_PTR2" width="16" begin="15" end="0" resetval="0x0" description="Queue 2" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue3" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue3" offset="0xD0C" width="32" description="">
		<bitfield id="QUEUE_H_PTR3" width="16" begin="15" end="0" resetval="0x0" description="Queue 3" range="15 - 0" rwaccess="R/W"/>
	</register>
