IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek13" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek13" offset="0xE34" width="32" description="">
		<bitfield id="QUEUE_H_PEEK_PTR13" width="16" begin="15" end="0" resetval="0x0" description="Queue 13 Peek portal" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek14" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek14" offset="0xE38" width="32" description="">
		<bitfield id="QUEUE_H_PEEK_PTR14" width="16" begin="15" end="0" resetval="0x0" description="Queue 14 Peek portal" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek15" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek15" offset="0xE3C" width="32" description="">
		<bitfield id="QUEUE_H_PEEK_PTR15" width="16" begin="15" end="0" resetval="0x0" description="Queue 15 Peek portal" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt0" offset="0xE40" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_0" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count0" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt1" offset="0xE44" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_1" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count1" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt2" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt2" offset="0xE48" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_2" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count2" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt3" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt3" offset="0xE4C" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_3" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count3" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt4" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt4" offset="0xE50" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_4" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count4" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt5" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt5" offset="0xE54" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_5" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count5" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt6" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt6" offset="0xE58" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_6" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count6" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt7" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt7" offset="0xE5C" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_7" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count7" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt8" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt8" offset="0xE60" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_8" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count8" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt9" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt9" offset="0xE64" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_9" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count9" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt10" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt10" offset="0xE68" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_10" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count10" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt11" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt11" offset="0xE6C" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_11" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count11" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt12" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt12" offset="0xE70" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_12" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count12" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt13" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt13" offset="0xE74" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_13" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count13" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt14" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt14" offset="0xE78" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_14" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count14" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt15" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt15" offset="0xE7C" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_15" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count15" range="15 - 0" rwaccess="R"/>
	</register>
