IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt38" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt38" offset="0xED8" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_38" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count38" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt39" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt39" offset="0xEDC" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_39" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count39" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt40" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt40" offset="0xEE0" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_40" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count40" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt41" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt41" offset="0xEE4" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_41" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count41" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt42" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt42" offset="0xEE8" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_42" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count42" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt43" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt43" offset="0xEEC" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_43" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count43" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt44" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt44" offset="0xEF0" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_44" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count44" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt45" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt45" offset="0xEF4" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_45" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count45" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt46" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt46" offset="0xEF8" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_46" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count46" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt47" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt47" offset="0xEFC" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_47" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count47" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt48" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt48" offset="0xF00" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_48" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count48" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt49" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt49" offset="0xF04" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_49" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count49" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt50" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt50" offset="0xF08" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_50" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count50" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt51" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt51" offset="0xF0C" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_51" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count51" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt52" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt52" offset="0xF10" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_52" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count52" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt53" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt53" offset="0xF14" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_53" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count53" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt54" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt54" offset="0xF18" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_54" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count54" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt55" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt55" offset="0xF1C" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_55" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count55" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt56" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt56" offset="0xF20" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_56" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count56" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt57" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt57" offset="0xF24" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_57" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count57" range="15 - 0" rwaccess="R"/>
	</register>
